[
    {
        "title": "Say Goodbye to Annoying Ads",
        "date": "13th June 2023",
        "content": "<p>Discover how to block nearly all ads on your Android or iOS device for free without needing to download any additional apps.<\/p><h1>Working of AdGuard DNS<\/h1><p>AdGuard DNS is a service that works by filtering out unwanted and malicious content from your internet traffic before it reaches your device. It does this by redirecting your DNS requests to their own servers, where they are analyzed and filtered.<\/p><p>AdGuard DNS blocks ads, trackers, phishing websites, and malicious domains, which helps to protect your privacy and security while browsing the internet. Essentially, it acts as a protective shield between your device and the internet, ensuring that you only receive safe and relevant content.<\/p><h1>The Solution (free)<\/h1><h3>You can also download AdGuard from your app store! (paid)<\/h3><h2>Adding Custom DNS to an Android Device<\/h2><ol><li>Open Settings on your Android device.<\/li><li>Tap on Wi-Fi or Network &amp; Internet depending on your device.<\/li><li>Find and tap on the network you want to modify.<\/li><li>Tap on the gear icon next to the network name.<\/li><li>Scroll down and select Advanced options.<\/li><li>Look for the DNS option and tap on it.<\/li><li>Enter the IP address of the DNS server you want to use.<\/li><li>Tap the Save button to apply the changes.<\/li><\/ol><h2>Adding Custom DNS to an iPhone<\/h2><ol><li>Open the Settings app on your iPhone.<\/li><li>Tap on Wi-Fi.<\/li><li>Find and tap on the network you want to modify.<\/li><li>Tap on the i icon next to the network name.<\/li><li>Scroll down and look for the DNS option.<\/li><li>Tap on Configure DNS and select Manual.<\/li><li>Tap on Add Server and enter the IP address of the DNS server you want to use.<\/li><li>Tap Save to save the changes.<\/li><\/ol><img src=\"https:\/\/lh3.googleusercontent.com\/vlEHlnRwrJ713eMPXbn1LbH7iAc7vWGXdhWJQZJQLWk8yOt12AvU6aHOeG69kk7csHtZV3DedMp3U8C6VC_CjLM-ug=w640-h400-e365-rj-sc0x00ffffff\" alt=\"AdGuard DNS\"><h1>AdGuard on a laptop\/PC<\/h1><p>Just add AdGuard browser extension to your browser.<\/p><h4>Note: This will not block ads from apps like YouTube and Google Play Store<\/h4><h4>Reason: the ads are hardcoded into the application.<\/h4>",
        "image": "https://images.unsplash.com/photo-1542586484-1ba19fe1ad53?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=2340&q=80"
  },
    {
        "title": "Color tools for designers",
        "date": "15th June 2023",
        "content": "<p>Unleash your creativity with our diverse range of color palettes and user-friendly color pickers, and embrace the endless possibilities of the color spectrum.<\/p><p>As a web designer or graphic artist, you come across numerous colors on the web or images that you may want to use in your designs. To save you the hassle of memorizing color values, an eyedropper tool or color picker is a must-have. Here are more than 20 of them, with convenient features for both PC and mobile phone.<\/p><h1>Realtime Colors (Recommended  + Best)<\/h1><p><a href=\"https:\/\/realtimecolors.com\">RealTimeColors<\/a> is a web application that allows users to generate dynamic and eye-catching color palettes in real-time. With a simple and intuitive interface, users can explore various color combinations and adjust color values to create the perfect palette for their design needs. RealTimeColors also provides useful features such as saving and sharing palettes, and integrating with popular design tools like Figma and Sketch. Whether you're a designer, developer, or anyone looking for beautiful color schemes, RealTimeColors is a powerful tool that makes creating and experimenting with colors easy and fun. It also allows you to use custom fonts for testing with the colors.<\/p><br><h1>Desktop Apps<\/h1><h2>Colorpicker 5 (Free)<\/h2><p>A minimal desktop app, Colorpicker comes with a simple interface. It comes with a picker that allows you to grab any color on your screen and check its Hexadecimal or RGB code. You can also save your colors in a color book. Plus, there’s a tinting tool that helps you find the best tint.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/github.com\/Toinane\/colorpicker\/releases\/tag\/2.2.0\">Windows<\/a><\/p><h2>Just Color Picker 1 (Free)<\/h2><p>Just Color Picker is not just your average color picker. It displays colors in HTML, RGB, HEX, HSB\/HSV, and HSL formats. It has a magnifier with three different settings, RGB and RYB color wheel to display triads and complementary colors, a color finder for harmonious matching, color code conversions, and much more!<\/p><p>Download for:<\/p><p><a href=\"https:\/\/annystudio.com\/software\/colorpicker\/#download\">WindowsMac<\/a><\/p><h2>Digital Color Meter (Native Mac)<\/h2><p>Digital Color Meter is a macOS app that lets you find the value or code of any color by moving an aperture over any part of your screen. You will see the colors in a Digital Color Meter window. You can also increase or decrease the size of the aperture, lock its position, and change the format of the displayed color value.<\/p><p>Download For:<\/p><p><a href=\"https:\/\/support.apple.com\/en-hk\/guide\/digital-color-meter\/welcome\/mac\">Mac<\/a><\/p><h2>ColorSlurp 2 (Free)<\/h2><p>Available as both an iOS and macOS app, ColorSlurp features a high-precision magnifier to get the color code information of any color on your screen. It enables you to organize palettes, check color contrast for accessibility, choose colors will your camera, and sync with iCloud.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/apps.apple.com\/us\/app\/colorslurp\/id1287239339?ls=1&mt=12\">Mac<\/a><\/p><h2>Color Peeker 1 (Free)<\/h2><p>A real-time digital color meter, Color Peeker that tells you the hex code of any color under your mouse pointer. The macOS app creates an icon in your menu bar so you can easily use it at any time. Plus, a simple right-click lets you copy the color code and you can use it anywhere.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/apps.apple.com\/us\/app\/color-peeker\/id1592573138?mt=12\">Mac<\/a><\/p><h2>System Color Picker 1 (Free)<\/h2><p>System Color Picker sits quietly in your menu bar and gets up to work as you toggle it on. Through a small color sampler window, you can pick any color and check its information. You can copy the colors as Hex codes, RGB, HSL, or LCH.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/apps.apple.com\/app\/id1545870783\">Mac<\/a><\/p><h2>Pikka Color Picker 1 (Free)<\/h2><p>Pikka is a color picker and palette-generator tool that works perfectly with multiple screens. Just pick any color through the pointer and simply copythe color code to your clipboard. Pikka also allows you to create and share color palettes with your team, which is a useful feature for collaboration.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/apps.apple.com\/app\/id1195076754\">Mac<\/a><\/p><br><h1>Browser Extensions<\/h1><h2>ColorZilla (Free)<\/h2><p>ColorZilla is a browser extension for Chrome and Firefox that allows you to pick colors from any web page. It offers an eyedropper tool, color history, and a palette viewer. ColorZilla also provides a CSS gradient generator, which is a handy tool for designers.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/chrome.google.com\/webstore\/detail\/colorzilla\/bhlhnicpbhignbdhedgjhgdocnmhomnp\">Chrome<\/a><\/p><p><a href=\"https:\/\/addons.mozilla.org\/en-US\/firefox\/addon\/colorzilla\/\">Firefox<\/a><\/p><h2>Eye Dropper (Free)<\/h2><p>Eye Dropper is a simple Chrome extension that lets you pick colors from any webpage. It saves your recently picked colors and also provides you with a color picker to choose any color manually.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/chrome.google.com\/webstore\/detail\/eye-dropper\/hmdcmlfkchdmnmnmheododdhjedfccka\">Chrome<\/a><\/p><h2>Instant Eyedropper (Free)<\/h2><p>Instant Eyedropper is a free browser extension available for Chrome. It offers a simple yet powerful color picker that allows you to identify the color codes of any element on a web page. You can copy the color code in various formats, including HTML, RGB, and HSB\/HSV.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/chrome.google.com\/webstore\/detail\/instant-eyedropper\/nenibigflkdikhamlnekjgldbkefencl\">Chrome<\/a><\/p><br><h1>Mobile Apps<\/h1><h2>Color Grab (Free)<\/h2><p>Color Grab is an Android app that allows you to capture, identify, and save colors from any source, including your camera, gallery, or screenshot. It also features a color mixer, palette builder, and color converter.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.lassyalone.colorgrab&hl=en_US\">Android<\/a><\/p><h2>Pixolor (Free)<\/h2><p>Pixolor is an Android app that functions as a floating eyedropper tool, allowing you to pick colors from any app on your device. It shows the color code in various formats, such as HEX, RGB, and HSL.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/play.google.com\/store\/apps\/details?id=com.embermitre.pixolor.app&hl=en_US\">Android<\/a><\/p><h2>Colorpicker (Free)<\/h2><p>Colorpicker is an iOS app that offers a simple and easy-to-use color picker tool. You can pick colors from any image, view the color code in various formats, and save or share the color codes with others.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/apps.apple.com\/us\/app\/colorpicker\/id1347177335\">iOS<\/a><\/p><h2>Color Picker (Free)<\/h2><p>Color Picker is an iOS app that allows you to pick colors from any image on your device. You can view the color code in HEX, RGB, and HSL formats, and save or share the color codes easily.<\/p><p>Download for:<\/p><p><a href=\"https:\/\/apps.apple.com\/us\/app\/color-picker\/id1462985133\">iOS<\/a><\/p><br><p>Now you have a plethora of color picker tools to choose from, depending on your platform and preferences. No more guessing or struggling to find the perfect color for your design projects. With these color pickers, you can easily identify, save, and use colors from any source. Happy designing!<\/p>",
        "image": "https://images.unsplash.com/photo-1589566983471-a0e73071c282?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1332&q=80"
  },
    {
        "title": "Buid a Blog using Github Pages",
        "date": "26th June 2023",
        "content": "<p>Discover How to Build and Manage Your Own Blog Without Spending Money on Platforms like WordPress or Blogger - Take Control of Your Online Presence!<\/p><br><p>With GitHub Pages, I've developed an effortless method for creating a blog website that gives you full control over its design. All you need is a basic understanding of HTML, CSS, and JavaScript syntax, and you can start customizing your site to suit your preferences. This straightforward solution has you covered, as long as you have a minimal understanding of HTML syntax.<\/p><br><h4>Let's begin! (Feel free to skip some steps if you already have a GitHub page)<\/h4><br><h1>Step 1: Set up a GitHub account<\/h1><p>If you already have a GitHub account, skip ahead to Step 2: Set up GitHub Pages. To create a new account, follow these steps:<br><br>1. Go to https:\/\/github.com\/join.<br>2. Enter a username, your email address, and a password.<br>3. Click Sign up for GitHub, and then follow the instructions.<\/p><br><h1>Step 2: Set up GitHub Pages<\/h1><p>1. Go to github.com and sign in to your account.<br>2. Click on the + button in the top right corner of the screen and select NEW REPOSITORY from the drop-down menu to create a new repository.<br>3. Name your repository using the format: yourusername.github.io. Replace YOURUSERNAME with your actual GitHub username.<br>4. Select the appropriate options for making your repository public or private, and add a README file if desired.<br>5. Click the CREATE REPOSITORY button at the bottom of the page.<br>6. Access the repository's settings by clicking on the SETTINGS tab in the top navigation bar.<br>7. Scroll down to the GITHUB PAGES section and select the main branch as the source of your site. Optionally, choose a theme.<br>8. Click SAVE to activate your GitHub page.<br>Your blog website is now live at yourusername.github.io. You can start customizing your site by adding HTML, CSS, and JavaScript files to your repository and pushing them to the main branch.<\/p><br><img src=\"https:\/\/user-images.githubusercontent.com\/71588718\/248682356-96d02aec-6cd0-4e5e-b48e-00b5cd277db7.png\"><br><h1>Step 3: Set up and write your first blog post<\/h1><br><p>1. Go to my blog solution <a href=\"https:\/\/github.com\/arunyagoojar\/Modern-Design-Blog-Builder-Solution\">repository.<\/a><br>2. Clone the repository to your GitHub page repository.<br>3. Customize the HTML title, description, name of the blog, and your name on the HTML file.<br>4. Open the data.json file.<br>5. Add your blog content to the data.json file.<br>If you want to add images, make sure to follow the format in the example data.json file for adding images.<\/p><img src=\"https:\/\/user-images.githubusercontent.com\/71588718\/248682269-1d922433-701f-49da-8e6c-9cd70e18f642.png\"><p>In conclusion, creating a blog website doesn't have to be expensive. By using GitHub Pages and possessing basic knowledge of HTML, CSS, and JavaScript syntax, you can build and manage your own blog without relying on platforms like WordPress or Blogger. The step-by-step guide provided helps you set up your GitHub account and repository, customize your site's appearance, and begin writing your first blog post in no time. Seize control of your online presence and start building your personal blog today!<\/p>",
        "image": "https://images.unsplash.com/photo-1471107340929-a87cd0f5b5f3?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=1973&q=80"
    }
]
